Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/back_to_education/social_welfare_payments_and_the_student_maintenance_grant_for_the_2010_11_academic_year.html.txt.tmx
Source language: en
Languages: ga

source: If you are getting a Disability Allowance (DA) you have 2 options and you need to work out which will give you the higher income
ga: Tá dhá rogha agat má tá Liúntas Míchumais á fháil agat agus caithfidh tú a dhéanamh amach cé acu a chuirfidh an t-ioncam is airde ar fáil duit

source: You can stay on your Disability Allowance and apply for a student grant
ga: Feadfaidh tú an Liúntas Míchumais atá á fháil agat a choinneáil agus cur isteach ar dheontas cothaithe

source: If you choose this option you will continue to get your Disability Allowance at your current rate
ga: Má thograíonn tú é sin a dhéanamh leanfaidh tú ort ag fáil an Liúntais Mhíchumais ar an ráta reatha

source: However, you will lose secondary benefits such as Rent Supplement or Mortgage Interest Supplement
ga: Caillfidh tú aon sochar tánaisteach atá á fháil agat, áfach, mar Fhorlíonadh Cíosa nó Fhorlíonadh Ús Morgáiste

source: If you are living at home, your parents’ income could affect the amount of grant you get. It may mean you get a reduced amount of maintenance grant, or just the fee component of the student grant, or neither
ga: D’fhéadfadh tionchar a bheith ag ioncam do thuismitheoirí ar méid an deontais chothaithe a gheobhaidh tú má tá tú i do chónaí sa bhaile

source: If your course of study has an Erasmus component (study at a college abroad), your DA payment will not be paid while you are absent from the State
ga: D’fhéadfá deontas cothaithe laghdaithe a fháil dá bharr, nó gan ach an Táille Sheirbhísí Mac Léinn a fháil, nó d’fhéadfá gan ceachtar acu a fháil ar chor ar bith

source: You can transfer from your Disability Allowance to the Back to Education Allowance (BTEA)
ga: Féadfaidh tú aistriú ón Liúntas Míchumais atá á fháil agat go dtí an Liúntas um Fhilleadh ar an Oideachas (LFO)

source: If you choose this option and qualify for BTEA you will not get the maintenance component of the student grant
ga: Má thograíonn tú é sin a dhéanamh agus má tá tú incháilithe chun an LFO a fháil ní bhfaighidh tú deontas cothaithe

source: Your rate of payment on BTEA will be the same as the rate of Disability Allowance you were getting and you can keep any secondary benefits you may be getting
ga: Gheobhaidh tú an LFO ar an ráta céanna agus uasráta an Liúntais Mhíchumais agus féadfaidh tú aon sochar tánaisteach atá á fháil agat a bheith agat i gcónaí

source: Your BTEA will continue to be paid if you are required to study abroad for an Erasmus year
ga: Má athraíonn tú ó ráta laghdaithe go ráta uasta an Liúntais Mhíchumais d’fhéadfadh sé sin tionchar a bheith aige ar an bhForlíonadh Cíosa nó ar an bhForlíonadh Ús Morgáiste
